numbers = [41, 122, 123, 13, 123, 120, 136, 141, 140, 266, 391, 393, 266, 303, 393, 13, 41, 123, 136, 137, 141, 266, 264, 391, 120, 123, 122, 122, 123, 431, 122, 430, 429, 429, 433, 432, 431, 435, 434, 430, 434, 433, 428, 432, 435, 31, 136, 29, 135, 141, 137, 31, 135, 137, 29, 134, 8, 136, 138, 134, 263, 391, 390, 159, 391, 286, 263, 284, 390, 264, 395, 391, 267, 390, 394, 31, 137, 136, 29, 136, 134, 136, 140, 138, 263, 264, 391, 159, 264, 391, 267, 263, 390]

count = {}

for num in numbers:
    if num in count:
        count[num] += 1
    else:
        count[num] = 1

max_count = max(count.values())

numbers_with_max_count = [num for num, count in count.items() if count == max_count]

print(f"Числа, которые встречаются большее количество раз: {numbers_with_max_count}")
